pitzDaily/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontAndBack
    {
        type            empty;
        physicalType    empty;
        nFaces          12800;
        startFace       12640;
    }
    upperWall
    {
        type            patch;
        physicalType    patch;
        nFaces          160;
        startFace       25440;
    }
    lowerWall
    {
        type            patch;
        physicalType    patch;
        nFaces          120;
        startFace       25600;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          20;
        startFace       25720;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          20;
        startFace       25740;
    }
)

// ************************************************************************* //
